// Auto-generated from IDA VFTABLE/RTTI scan.
// This header is a skeleton for reverse-engineering; adjust as needed.
#pragma once

#include <string>

#include "IUnit.h"
#include "moho/ai/CAiSiloBuildImpl.h"
#include "moho/entity/Entity.h"
#include "moho/math/Vector3f.h"

namespace LuaPlus { class LuaObject; class LuaState; } // forward decl

namespace moho { class EUnitState; class EntId; class RUnitBlueprint; class StatItem; class UnitAttributes; class UserUnit; class VTransform; } // forward decl
namespace Wm3 { class Vector3; } // forward decl
namespace gpg { class StrArg; } // forward decl

namespace moho
{
    /**
     * VFTABLE: 0x00E2A574
     * COL:  0x00E83CA4
     */
    class Unit : public IUnit, public Entity
    {
    public:
        /**
         * Address: 0x006A4BC0
         * Slot: 0
         * Demangled: public: virtual class moho::Unit const near * __thiscall moho::Unit::IsUnit(void)const
         */
        virtual Unit const* IsUnit() const = 0;

        /**
         * Address: 0x006A4BB0
         * Slot: 1
         * Demangled: public: virtual class moho::Unit near * __thiscall moho::Unit::IsUnit(void)
         */
        virtual Unit* IsUnit() = 0;

        /**
         * Address: 0x006A48E0
         * Slot: 2
         * Demangled: public: virtual class moho::UserUnit const near * __thiscall moho::IUnit::IsUserUnit(void)const
         */
        virtual UserUnit const* IsUserUnit() const = 0;

        /**
         * Address: 0x006A48D0
         * Slot: 3
         * Demangled: public: virtual class moho::UserUnit near * __thiscall moho::IUnit::IsUserUnit(void)
         */
        virtual UserUnit* IsUserUnit() = 0;

        /**
         * Address: 0x006A49A0
         * Slot: 4
         * Demangled: public: virtual class moho::EntId __thiscall moho::Unit::GetEntityId(void)const
         */
        virtual EntId GetEntityId() const = 0;

        /**
         * Address: 0x006A49B0
         * Slot: 5
         * Demangled: public: virtual class Wm3::Vec3f const near & __thiscall moho::Unit::GetPosition(void)const
         */
        virtual Wm3::Vec3f const& GetPosition() const = 0;

        /**
         * Address: 0x006A49C0
         * Slot: 6
         * Demangled: public: virtual class moho::VTransform const near & __thiscall moho::Unit::GetTransform(void)const
         */
        virtual VTransform const& GetTransform() const = 0;

        /**
         * Address: 0x006A8B20
         * Slot: 7
         * Demangled: public: virtual class moho::RUnitBlueprint const near * __thiscall moho::Unit::GetBlueprint(void)const
         */
        virtual RUnitBlueprint const* GetBlueprint() const = 0;

        /**
         * Address: 0x006A49D0
         * Slot: 8
         * Demangled: public: virtual class LuaPlus::LuaObject __thiscall moho::Unit::GetLuaObject(void)
         */
        virtual LuaPlus::LuaObject GetLuaObject() = 0;

        /**
         * Address: 0x006A8B30
         * Slot: 9
         * Demangled: public: virtual float __thiscall moho::Unit::CalcTransportLoadFactor(void)const
         */
        virtual float CalcTransportLoadFactor() const = 0;

        /**
         * Address: 0x006A49F0
         * Slot: 10
         * Demangled: public: virtual bool __thiscall moho::Unit::IsDead(void)const
         */
        virtual bool IsDead() const = 0;

        /**
         * Address: 0x006A4A00
         * Slot: 11
         * Demangled: public: virtual bool __thiscall moho::Unit::DestroyQueued(void)const
         */
        virtual bool DestroyQueued() const = 0;

        /**
         * Address: 0x006A4A10
         * Slot: 12
         * Demangled: public: virtual bool __thiscall moho::Unit::IsMobile(void)const
         */
        virtual bool IsMobile() const = 0;

        /**
         * Address: 0x006A4A20
         * Slot: 13
         * Demangled: public: virtual bool __thiscall moho::Unit::IsBeingBuilt(void)const
         */
        virtual bool IsBeingBuilt() const = 0;

        /**
         * Address: 0x006A7DC0
         * Slot: 14
         * Demangled: public: virtual bool __thiscall moho::Unit::IsNavigatorIdle(void)const
         */
        virtual bool IsNavigatorIdle() const = 0;

        /**
         * Address: 0x006A4AF0
         * Slot: 15
         * Demangled: public: virtual bool __thiscall moho::Unit::IsUnitState(enum moho::EUnitState)const
         */
        virtual bool IsUnitState(EUnitState) const = 0;

        /**
         * Address: 0x006A4990
         * Slot: 16
         * Demangled: public: virtual struct moho::UnitAttributes near & __thiscall moho::Unit::GetAttributes(void)
         */
        virtual UnitAttributes& GetAttributes() = 0;

        /**
         * Address: 0x006A4980
         * Slot: 17
         * Demangled: public: virtual struct moho::UnitAttributes const near & __thiscall moho::Unit::GetAttributes(void)const
         */
        virtual UnitAttributes const& GetAttributes() const = 0;

        /**
         * Address: 0x006A4B90
         * Slot: 18
         * Demangled: public: virtual class moho::StatItem near * __thiscall moho::Unit::GetStat(class gpg::StrArg,class std::basic_string<char,struct std::char_traits<char>,class std::allocator<char>> const near &)
         */
        virtual StatItem* GetStat(gpg::StrArg, std::basic_string<char, std::char_traits<char>, std::allocator<char>> const&) = 0;

        /**
         * Address: 0x006A4B70
         * Slot: 19
         * Demangled: public: virtual class moho::StatItem near * __thiscall moho::Unit::GetStat(class gpg::StrArg,float const near &)
         */
        virtual StatItem* GetStat(gpg::StrArg, float const&) = 0;

        /**
         * Address: 0x006A4B50
         * Slot: 20
         * Demangled: public: virtual class moho::StatItem near * __thiscall moho::Unit::GetStat(class gpg::StrArg,int const near &)
         */
        virtual StatItem* GetStat(gpg::StrArg, int const&) = 0;

        /**
         * Address: 0x006A4B30
         * Slot: 21
         * Demangled: public: virtual class moho::StatItem near * __thiscall moho::Unit::GetStat(class gpg::StrArg)
         */
        virtual StatItem* GetStat(gpg::StrArg) = 0;

        /**
         * Address: 0x006A73A0
         * Slot: 22
         * Demangled: public: virtual void __thiscall moho::Unit::SetAutoMode(bool)
         */
        virtual void SetAutoMode(bool) = 0;

        /**
         * Address: 0x006A73E0
         * Slot: 23
         * Demangled: public: virtual void __thiscall moho::Unit::SetAutoSurfaceMode(bool)
         */
        virtual void SetAutoSurfaceMode(bool) = 0;

        /**
         * Address: 0x006A4A30
         * Slot: 24
         * Demangled: public: virtual bool __thiscall moho::Unit::IsAutoMode(void)const
         */
        virtual bool IsAutoMode() const = 0;

        /**
         * Address: 0x006A4A40
         * Slot: 25
         * Demangled: public: virtual bool __thiscall moho::Unit::IsAutoSurfaceMode(void)const
         */
        virtual bool IsAutoSurfaceMode() const = 0;

        /**
         * Address: 0x006A4A50
         * Slot: 26
         * Demangled: public: virtual void __thiscall moho::Unit::SetCustomName(class std::basic_string<char,struct std::char_traits<char>,class std::allocator<char>>)
         */
        virtual void SetCustomName(std::basic_string<char, std::char_traits<char>, std::allocator<char>>) = 0;

        /**
         * Address: 0x006A4AB0
         * Slot: 27
         * Demangled: public: virtual class std::basic_string<char,struct std::char_traits<char>,class std::allocator<char>> __thiscall moho::Unit::GetCustomName(void)const
         */
        virtual std::basic_string<char, std::char_traits<char>, std::allocator<char>> GetCustomName() const = 0;

    public:
        class StatItem* Stats; //0x027C
        class StatsItem2* Stats2; //0x0280
        char pad_0284[16]; //0x0284
        float FuelRatio; //0x0294
        float ShieldRatio; //0x0298
        char pad_029C[4]; //0x029C
        bool IsPaused; //0x02A0
        char pad_02A1[11]; //0x02A1
        float BuildPercent; //0x02AC
        char pad_02B0[8]; //0x02B0
        int32_t BuildCurrentDefence; //0x02B8
        int32_t BuildCurrentAttack; //0x02BC
        int32_t BuildMaxDefence; //0x02C0
        int32_t BuildMaxAttack; //0x02C4
        char pad_02C8[72]; //0x02C8
        class CAniPose* AnimationPose; //0x0310
        char pad_0314[412]; //0x0314
        class CMotionEngine* MotionEngine; //0x04B0
        class N00001C07* CommandQueue; //0x04B4
        char pad_04B8[64]; //0x04B8
        class AiImplHolder* AiImplementations; //0x04F8
        char pad_04FC[72]; //0x04FC
        class CAiAttackerImpl* AiAttacker; //0x0544
        class IAiCommandDispatchImpl* AiCommandDispatch; //0x0548
        char pad_054C[12]; //0x054C
        CAiSiloBuildImpl* AiSiloBuild; //0x0558
        void* AiTransport; //0x055C
        char pad_0560[60]; //0x0560
        Vector3f N000008B5; //0x059C
        char pad_05A8[192]; //0x05A8
        int32_t TickCount2; //0x0668
        char pad_066C[20]; //0x066C
        class CReconBlip* ReconBlip; //0x0680
        char pad_0684[10]; //0x0684
        bool updWeaponRadius; //0x068E
        char pad_068F[111]; //0x068F
    };

    /**
     * VFTABLE: 0x00E1F4CC
     * COL:  0x00E76454
     */
    class UnitTransportDetachAllUnits_LuaFuncDef
    {
    public:
        /**
         * Address: 0x004CD3A0
         * Slot: 0
         * Demangled: protected: virtual void __thiscall moho::CScrLuaBinder::Run(class LuaPlus::LuaState near *)
         */
        virtual void Run(LuaPlus::LuaState*) = 0;
    };

    /**
     * VFTABLE: 0x00E2D3A8
     * COL:  0x00E86EC8
     */
    class UnitGetUnitId_LuaFuncDef
    {
    public:
        /**
         * Address: 0x004CD3A0
         * Slot: 0
         * Demangled: protected: virtual void __thiscall moho::CScrLuaBinder::Run(class LuaPlus::LuaState near *)
         */
        virtual void Run(LuaPlus::LuaState*) = 0;
    };

    /**
     * VFTABLE: 0x00E2D3B0
     * COL:  0x00E86E78
     */
    class UnitSetCreator_LuaFuncDef
    {
    public:
        /**
         * Address: 0x004CD3A0
         * Slot: 0
